---
kind: type
id: T:Autodesk.Revit.DB.SchedulableField
source: html/84f03bb5-a9b8-581c-631c-6240b4954099.htm
---
# Autodesk.Revit.DB.SchedulableField

A non-calculated field eligible to be included in a schedule.

## Syntax (C#)
```csharp
public class SchedulableField : IDisposable
```

## Remarks
The SchedulableField class represents a non-calculated field that is
 eligible to be included in a schedule. A list of fields that can be
 included in a schedule can be obtained from
 ScheduleDefinition.GetSchedulableFields.